// Даны два числа. Показать большее и меньшее число.

double a = 2.5;
double b = 3.7;

if (a>b) System.Console.WriteLine($"Меньшее число - {b}, большее число - {a}");
if (b>a) System.Console.WriteLine($"Меньшее число - {a}, большее число - {b}");
if (a==b) System.Console.WriteLine($"Заданные числа одинаковы");
